; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v3)
             (pred_12 ?v13 ?v11)
             (pred_1 ?v4 ?v11)
             (pred_2 ?v8 ?v4 )
	     (pred_11 ?v4)
             (pred_8 ?v1)
             (pred_3 ?v13)
             (pred_5 ?v11)
             (pred_6 ?v4)
             (pred_4 ?v13)
             (pred_7 ?v4)
             (pred_9 ))



(:action op_1
:parameters (?v5 ?v2 ?v6 ?v12)
:precondition (and (pred_8 ?v5) (pred_8 ?v2) (pred_3 ?v6) (pred_5 ?v12)
          (pred_10 ?v5 ?v2) (pred_12 ?v6 ?v12)
                   (pred_1 ?v2 ?v12) (pred_11 ?v5) 
                   (pred_6 ?v2) (pred_4 ?v6))
:effect (and  (pred_7 ?v2) (not (pred_6 ?v2))))


(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_8 ?v5) (pred_8 ?v9)
               (pred_11 ?v5) (pred_10 ?v5 ?v9) (pred_7 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v5))))

(:action op_5
:parameters (?v5 ?v6)
:precondition (and (pred_8 ?v5) (pred_3 ?v6) 
                  (pred_11 ?v5) (pred_2 ?v6 ?v5) (pred_9 ))
:effect (and (pred_4 ?v6)
   (not (pred_2 ?v6 ?v5)) (not (pred_9 ))))


(:action op_3
:parameters (?v5 ?v10 ?v7)
:precondition (and (pred_8 ?v5) (pred_3 ?v10) (pred_3 ?v7)
                  (pred_11 ?v5) (pred_4 ?v7) (pred_2 ?v10 ?v5))
:effect (and (pred_4 ?v10) (pred_2 ?v7 ?v5)
        (not (pred_4 ?v7)) (not (pred_2 ?v10 ?v5))))

(:action op_4
:parameters (?v5 ?v6)
:precondition (and (pred_8 ?v5) (pred_3 ?v6) 
                  (pred_11 ?v5) (pred_4 ?v6))
:effect (and (pred_9 ) (pred_2 ?v6 ?v5) (not (pred_4 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_06 obj_17 obj_04 obj_19 obj_11 obj_21 obj_09 obj_12 obj_16 obj_10 obj_02 obj_18 obj_07 obj_01 obj_14
    obj_05 obj_08 obj_13
    obj_15 obj_22 obj_20
    )

    (:init
       (pred_9)

       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_12)
       (pred_8 obj_16)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_3 obj_15)
       (pred_3 obj_22)
       (pred_3 obj_20)

       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_17)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_19 obj_11)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_11 obj_21)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_19)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_21 obj_09)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_11)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_09 obj_21)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_02 obj_14)
       (pred_10 obj_02 obj_09)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_18 obj_07)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_07 obj_01)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_07 obj_18)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_07)
       (pred_10 obj_14 obj_02)
       (pred_10 obj_14 obj_01)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_1  obj_02 obj_05)
       (pred_1  obj_18 obj_08)
       (pred_1  obj_10 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_19)
       (pred_7 obj_11)
       (pred_7 obj_21)
       (pred_7 obj_09)
       (pred_7 obj_12)
       (pred_7 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_14)

       (pred_12  obj_15 obj_05)
       (pred_12  obj_22 obj_08)
       (pred_12  obj_20 obj_13)
       (pred_2 obj_15 obj_14)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_20 obj_14)
       (pred_11 obj_14)
    )

    (:goal (and
       (pred_2 obj_15 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_11)))
)
)

; plan
1. (op_5 obj_14 obj_15)
   deleted: (pred_2 obj_15 obj_14) (pred_9)
   added: (pred_4 obj_15)
   goals met: 0 of 1
2. (op_2 obj_14 obj_01)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_01)
   goals met: 0 of 1
3. (op_2 obj_01 obj_07)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_07)
   goals met: 0 of 1
4. (op_2 obj_07 obj_16)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_16)
   goals met: 0 of 1
5. (op_2 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 0 of 1
6. (op_2 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_03)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_03)
   goals met: 0 of 1
8. (op_4 obj_03 obj_15)
   deleted: (pred_4 obj_15)
   added: (pred_9) (pred_2 obj_15 obj_03)
   goals met: 1 of 1
